//1)  Visual studio - Console Application
//2)  Создать приложение калькулятор:
//3)  Интерфейс и содержание кода полностью на английском(пользуйтесь переводчиком)
//4)  Читабельная структура программы, соответствующая конвенциям написания кода и именования (содержит информативные комментарии) 
//5)  Добавить функцию вывести 5 последних результатов операций (ответов)
//6)  Меню взаимодействия с пользователем, в том числе, по окончанию операции - начать сначала, повторить последнее действие (вводить только числа без действия), выйти
//7)  Приложение не должно падать ни при каких условиях – обработка всевозможных ситуаций
//8)  Дополнительно:
//•  возможность вводить пример в одну строку
//•  в несколько действий.
